In [1]:
x=[1,2,'a','b']

In [2]:
x

[1, 2, 'a', 'b']

In [4]:
x=None

In [6]:
x

In [8]:
list1=[]
list1.insert(0,'A')

In [9]:
list1

['A']

In [64]:
def calc(**kwargs):
    for key in kwargs.keys():
        print(key,kwargs[key])
    return kwargs

In [65]:
calc(인사 = '안녕하세요')

인사 안녕하세요

{'인사': '안녕하세요'}

In [27]:
def print_kwargs(**kwargs):
    return kwargs

In [46]:
print_kwargs(인사 = '안녕하세요')

{'인사': '안녕하세요'}

In [33]:
def print_args(*args):
    return args

In [36]:
print_args(1,2,3,4,5,6,7)

(1, 2, 3, 4, 5, 6, 7)

In [47]:
print('hello','world')

hello world

In [48]:
print('hello','world',sep='|')

hello|world

In [25]:
print('hello','world',sep='/\\')

hello/\world

In [24]:
print('hello','world',end='  ')
print('hello','python')

hello world  hello python

print('{0},{1}'.format(value1,value2))

In [52]:
print('This is {}. That is {}.' .format('apple','banana'))

This is apple. That is banana.

In [53]:
print('This is {1}. That is {0}.' .format('apple','banana'))

This is banana. That is apple.

In [54]:
a='apple'
b='banana'
print('This is {}. That is {}.' .format(a,b))

This is apple. That is banana.

In [55]:
a='apple'
b='banana'
print('This is {}. That is {}.' .format(b,a))

This is banana. That is apple.

In [56]:
print('This is {fruit1}. That is {fruit2}'.format(fruit1='apple', fruit2='banana'))

This is apple. That is banana

In [57]:
print('This is {0:0.3f}'.format(13.45678))## 3자리 까지 출력 4자리에서 반올림 중요!!!!!!!!!!!!!!!!!!!!!!!

This is 13.457

In [60]:
print('This is {0:0.10f}'.format(13.45678))

This is 13.4567800000

In [61]:
print('This is {:03d}'.format(12))

This is 012

In [96]:
print('This is {0:05d}'.format(1234))

This is 01234

In [66]:
print('This is {:3d}'.format(1234))

This is 1234

포맷팅
-  %s : 문자열
-  %d : 정수
-  %f : 실수
-  %0 : 8진수
-  %x : 16진수

In [68]:
print(f'This is %s. That is %s. '%('apple','banana'))

This is apple. That is banana.

In [26]:
print(f'This is %s. That is %s. These are %s'%('apple','banana','fineapples'))

This is apple. That is banana. These are fineapples

In [70]:
print(f'This is %s.' %('bottle'))

This is bottle.

In [72]:
print(f'The value is %d' % 1)

The value is 1

In [32]:
print(f'The value is %d' % 1,3)

The value is 1 3

In [77]:
print(f'The value is %05d' % 1)

The value is 00001

In [94]:
for i in range(2,10):
    for j in range(1,10):
        print(f'%d * %d = %2d'%(i,j,i*j))

2 * 1 =  2
2 * 2 =  4
2 * 3 =  6
2 * 4 =  8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18
3 * 1 =  3
3 * 2 =  6
3 * 3 =  9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27
4 * 1 =  4
4 * 2 =  8
4 * 3 = 12
4 * 4 = 16
4 * 5 = 20
4 * 6 = 24
4 * 7 = 28
4 * 8 = 32
4 * 9 = 36
5 * 1 =  5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45
6 * 1 =  6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54
7 * 1 =  7
7 * 2 = 14
7 * 3 = 21
7 * 4 = 28
7 * 5 = 35
7 * 6 = 42
7 * 7 = 49
7 * 8 = 56
7 * 9 = 63
8 * 1 =  8
8 * 2 = 16
8 * 3 = 24
8 * 4 = 32
8 * 5 = 40
8 * 6 = 48
8 * 7 = 56
8 * 8 = 64
8 * 9 = 72
9 * 1 =  9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81

In [95]:
for i in range(2,10):
    for j in range(1,10):
        print(f'%d * %d = %4d'%(i,j,i*j))

2 * 1 =    2
2 * 2 =    4
2 * 3 =    6
2 * 4 =    8
2 * 5 =   10
2 * 6 =   12
2 * 7 =   14
2 * 8 =   16
2 * 9 =   18
3 * 1 =    3
3 * 2 =    6
3 * 3 =    9
3 * 4 =   12
3 * 5 =   15
3 * 6 =   18
3 * 7 =   21
3 * 8 =   24
3 * 9 =   27
4 * 1 =    4
4 * 2 =    8
4 * 3 =   12
4 * 4 =   16
4 * 5 =   20
4 * 6 =   24
4 * 7 =   28
4 * 8 =   32
4 * 9 =   36
5 * 1 =    5
5 * 2 =   10
5 * 3 =   15
5 * 4 =   20
5 * 5 =   25
5 * 6 =   30
5 * 7 =   35
5 * 8 =   40
5 * 9 =   45
6 * 1 =    6
6 * 2 =   12
6 * 3 =   18
6 * 4 =   24
6 * 5 =   30
6 * 6 =   36
6 * 7 =   42
6 * 8 =   48
6 * 9 =   54
7 * 1 =    7
7 * 2 =   14
7 * 3 =   21
7 * 4 =   28
7 * 5 =   35
7 * 6 =   42
7 * 7 =   49
7 * 8 =   56
7 * 9 =   63
8 * 1 =    8
8 * 2 =   16
8 * 3 =   24
8 * 4 =   32
8 * 5 =   40
8 * 6 =   48
8 * 7 =   56
8 * 8 =   64
8 * 9 =   72
9 * 1 =    9
9 * 2 =   18
9 * 3 =   27
9 * 4 =   36
9 * 5 =   45
9 * 6 =   54
9 * 7 =   63
9 * 8 =   72
9 * 9 =   81

In [83]:
print(f'The value is %.3f' % 123.45678)

The value is 123.457

In [84]:
print('The value is %.3f' % 123.45678)

The value is 123.457

In [68]:
print('The value is %.2f' % 123.423)

The value is 123.42

2진수 0 1 10 11 100 101 110 111

10진수 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17
16진수 0 1 2 3 4 5 6 7 8 9 a  b  c  d  e  f  10 11

In [91]:
for i in range(10):
    print(f'The value is %o.' %i)

The value is 0.
The value is 1.
The value is 2.
The value is 3.
The value is 4.
The value is 5.
The value is 6.
The value is 7.
The value is 10.
The value is 11.

In [92]:
for i in range(18):
    print(f' The value is %x.' %i)

 The value is 0.
 The value is 1.
 The value is 2.
 The value is 3.
 The value is 4.
 The value is 5.
 The value is 6.
 The value is 7.
 The value is 8.
 The value is 9.
 The value is a.
 The value is b.
 The value is c.
 The value is d.
 The value is e.
 The value is f.
 The value is 10.
 The value is 11.

In [66]:
print(f'%0.2f%%' %90) ## 퍼센트입력하기

90.00%

### PANDAS

In [38]:
import pandas as pd

In [39]:
list_var=['a','b','c','d']

In [40]:
type(list_var)

list

In [42]:
series_var=pd.Series(list_var, index=[1,2,3,4])

In [44]:
series_var

1    a
2    b
3    c
4    d
dtype: object

In [45]:
type(series_var)

pandas.core.series.Series

In [46]:
series_var2=pd.Series({1:'a',2:'b',3:'c',4:'d'})

In [47]:
series_var2

1    a
2    b
3    c
4    d
dtype: object

In [48]:
series_var[1]

'a'

### DATAFRAME

-  DataFrame=Series+Series+Series

In [51]:
df=pd.DataFrame({'name':['yejin','jiwon','sanghyeon'],
                 'age':['25','22','32'],
                 'gender':['F','F','M'] })

In [52]:
df

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [54]:
df['name']

0        yejin
1        jiwon
2    sanghyeon
Name: name, dtype: object

In [55]:
df['age']

0    25
1    22
2    32
Name: age, dtype: object

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      object
 2   gender  3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [59]:
df.head()#앞에 5개 불러온다

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [58]:
df.tail()#뒤에서 5개 불러온다

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [61]:
df['age']=df['age'].astype(int)

In [63]:
df['age']

0    25
1    22
2    32
Name: age, dtype: int32

In [64]:
df['age'].sum() #합

79

In [65]:
df['age'].mean() # 평균

26.333333333333332

In [67]:
df['age'].median() #중앙값

25.0

In [68]:
df['age'].max() #최대값

32

In [69]:
df['age'].min() #최소값

22

In [70]:
df['age'].var() # 분산

26.333333333333332

In [71]:
df['age'].std() #표준편차

5.131601439446884

In [72]:
df.describe()

             age
count   3.000000
mean   26.333333
std     5.131601
min    22.000000
25%    23.500000
50%    25.000000
75%    28.500000
max    32.000000

In [75]:
df[df['name']=='jiwon']

    name  age gender
1  jiwon   22      F

In [79]:
df[(df['age']>20) | (df['gender'] == '1')]

        name  age gender
0      yejin   25      F
1      jiwon   22      F
2  sanghyeon   32      M

### loc iloc

In [70]:
df=pd.DataFrame({'name':['yejin','jiwon','sanghyeon'],
                 'age':['25','22','32'],
                 'gender':['F','F','M'] }, index=['a','b','c'])

In [71]:
df

        name age gender
a      yejin  25      F
b      jiwon  22      F
c  sanghyeon  32      M

In [77]:
df['gender'][2]

'M'

In [74]:
df.loc['a']## 인덱스 기반

name      yejin
age          25
gender        F
Name: a, dtype: object

In [75]:
df.iloc[0] ## 순서 기반

name      yejin
age          25
gender        F
Name: a, dtype: object

In [90]:
df.iloc[0]['age']

'25'

In [91]:
df.iloc[0].name #인덱스 값 출력

'a'

In [92]:
df.iloc[0]['name']

'yejin'

In [79]:
import pandas  as pd

In [80]:
df1=pd.DataFrame({'A':[1,2,3,4],
                  'B':[5,6,7,8],
                  'C':[9,10,11,12]})
df2=pd.DataFrame({'A':[13,14,15,16],
                  'B':[17,18,19,20],
                  'C':[21,22,23,24]})

In [81]:
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [82]:
df2

    A   B   C
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [83]:
pd.concat([df1,df2])

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [84]:
df3=pd.concat([df1,df2])

In [85]:
df3.reset_index()

   index   A   B   C
0      0   1   5   9
1      1   2   6  10
2      2   3   7  11
3      3   4   8  12
4      0  13  17  21
5      1  14  18  22
6      2  15  19  23
7      3  16  20  24

In [86]:
df3.reset_index(drop=True)

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [101]:
df3=df3.reset_index(drop=True)

In [102]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [87]:
pd.concat([df1,df2],axis=0)

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [89]:
pd.concat([df1,df2],axis=1) ### axis 0 은 가로 1은 세로

   A  B   C   A   B   C
0  1  5   9  13  17  21
1  2  6  10  14  18  22
2  3  7  11  15  19  23
3  4  8  12  16  20  24

In [105]:
df1['D']=[13,14,15,16]

In [106]:
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [90]:
df1.drop('A',axis=1, inplace=True)  ###inplace=True == df1.drop('A',axis=1, inplace=True)

In [91]:
df1.drop('A',axis=1, inplace=True)  ###inplace=True == df1.drop('A',axis=1, inplace=True)

KeyError: "['A'] not found in axis"

In [110]:
df1

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

###  Groupby

In [152]:
data={'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'person':['Sam','Charlie','Amy','Veanessa','Carl','Sarah'],
      'Sales':[200,120,340,124,243,350]}

In [153]:
data

{'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'person': ['Sam', 'Charlie', 'Amy', 'Veanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [154]:
df=pd.DataFrame(data)

In [155]:
df

  company    person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [141]:
df['company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: company, dtype: int64

In [210]:
df['age'].mean() # 평균

df['Sales']

KeyError: 'age'

In [166]:
DF_G=df[df['company']=='GOOG']

In [167]:
SAL_G=DF_G['Sales'].mean()

In [168]:
SAL_G

160.0

In [169]:
DF_M=df[df['company']=='MSFT']

In [171]:
SAL_M=DF_M['Sales'].mean()

In [173]:
SAL_M

232.0

In [179]:
df[df['company']=='FB']['Sales'].mean()

296.5

In [174]:
for com in df['company'].unique():
    print(com)

GOOG
MSFT
FB

In [164]:
for com in df['company'].unique():
    print(com, df[df['company']==com]['Sales'].mean())

GOOG 160.0
MSFT 232.0
FB 296.5

In [180]:
df[df['company']=='FB']['Sales'].mean()

296.5

In [181]:
df.groupby('company')

In [182]:
list(df.groupby('company'))

[('FB',
    company person  Sales
  4      FB   Carl    243
  5      FB  Sarah    350),
 ('GOOG',
    company   person  Sales
  0    GOOG      Sam    200
  1    GOOG  Charlie    120),
 ('MSFT',
    company    person  Sales
  2    MSFT       Amy    340
  3    MSFT  Veanessa    124)]

In [183]:
df.groupby('company')['Sales'].mean()

company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [184]:
df.columns

Index(['company', 'person', 'Sales'], dtype='object')

In [188]:
df.groupby('company').mean()

         Sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [190]:
df.groupby('company').min()

          person  Sales
company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [189]:
df.groupby(['company','person']).min()

                  Sales
company person
FB      Carl        243
        Sarah       350
GOOG    Charlie     120
        Sam         200
MSFT    Amy         340
        Veanessa    124

In [191]:
df.groupby('company').count()

         person  Sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [193]:
df.groupby('company')['Sales'].describe()

         count   mean         std    min     25%    50%     75%    max
company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [204]:
df=pd.DataFrame({'수학점수':[65,80,60,80],
                '과학점수':[50,75,60,80],
                '내신등급':[3,1,2,1]})

In [205]:
df

   수학점수  과학점수  내신등급
0    65    50     3
1    80    75     1
2    60    60     2
3    80    80     1

In [206]:
df.sort_values(by='수학점수',ascending=False)#### ascending 오름차순

   수학점수  과학점수  내신등급
1    80    75     1
3    80    80     1
0    65    50     3
2    60    60     2

In [207]:
df.sort_values(['수학점수','과학점수'])

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
1    80    75     1
3    80    80     1

In [209]:
df.sort_values(['수학점수','과학점수'],ascending=[True,False])
### ['수학점수','과학점수'],asecending=[True,False] 수학점수에 먼저 1순위로 ascending이 적용되고
## 1순위 적용상태에서 2순위가 차선으로 적용된다. 수학점수가 같은 80점의 1,3이 한 그룹으로 묶이고
## 2차로 순위가 적용 되어서 2-0-(3,1)로 과학점수가 나오게 된다>

   수학점수  과학점수  내신등급
2    60    60     2
0    65    50     3
3    80    80     1
1    80    75     1

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv('midwest.csv')

In [3]:
data

,PID,county,state,area,poptotal,popdensity,popwhite,popblack,popamerindian,popasian,...,percollege,percprof,poppovertyknown,percpovertyknown,percbelowpoverty,percchildbelowpovert,percadultpoverty,percelderlypoverty,inmetro,category
0,561,ADAMS,IL,0.052,66090,1270.961540,63917,1702,98,249,...,19.631392,4.355859,63628,96.274777,13.151443,18.011717,11.009776,12.443812,0,AAR
1,562,ALEXANDER,IL,0.014,10626,759.000000,7054,3496,19,48,...,11.243308,2.870315,10529,99.087145,32.244278,45.826514,27.385647,25.228976,0,LHR
2,563,BOND,IL,0.022,14991,681.409091,14477,429,35,16,...,17.033819,4.488572,14235,94.956974,12.068844,14.036061,10.852090,12.697410,0,AAR
3,564,BOONE,IL,0.017,30806,1812.117650,29344,127,46,150,...,17.278954,4.197800,30337,98.477569,7.209019,11.179536,5.536013,6.217047,1,ALU
4,565,BROWN,IL,0.018,5836,324.222222,5264,547,14,5,...,14.475999,3.367680,4815,82.505140,13.520249,13.022889,11.143211,19.200000,0,AAR
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
432,3048,WAUKESHA,WI,0.034,304715,8962.205880,298313,1096,672,2699,...,35.396784,7.667090,299802,98.387674,3.121060,3.785820,2.590061,4.085479,1,HLU
433,3049,WAUPACA,WI,0.045,46104,1024.533330,45695,22,125,92,...,16.549869,3.138596,44412,96.330036,8.488697,10.071411,6.953799,10.338641,0,AAR
434,3050,WAUSHARA,WI,0.037,19385,523.918919,19094,29,70,43,...,15.064584,2.620907,19163,98.854785,13.786985,20.050708,11.695784,11.804558,0,AAR
435,3051,WINNEBAGO,WI,0.035,140320,4009.142860,136822,697,685,1728,...,24.995504,5.659847,133950,95.460376,8.804031,10.592031,8.660587,6.661094,1,HAU
436,3052,WOOD,WI,0.048,73605,1533.437500,72157,90,481,722,...,21.666382,4.583725,72685,98.750085,8.525831,11.162997,7.375656,7.882918,0,AAR

In [4]:
data.columns

Index(['PID', 'county', 'state', 'area', 'poptotal', 'popdensity', 'popwhite',
       'popblack', 'popamerindian', 'popasian', 'popother', 'percwhite',
       'percblack', 'percamerindan', 'percasian', 'percother', 'popadults',
       'perchsd', 'percollege', 'percprof', 'poppovertyknown',
       'percpovertyknown', 'percbelowpoverty', 'percchildbelowpovert',
       'percadultpoverty', 'percelderlypoverty', 'inmetro', 'category'],
      dtype='object')

In [8]:
dat=data.rename({'popasian':'asian','poptotal':'total'},axis=1)

In [9]:
Total=dat['total']

In [10]:
Asian=dat['asian']

In [11]:
dat['percent']=dat['asian']/dat['total']*100

In [12]:
dat['percent']

0      0.376759
1      0.451722
2      0.106731
3      0.486918
4      0.085675
         ...
432    0.885746
433    0.199549
434    0.221821
435    1.231471
436    0.980912
Name: percent, Length: 437, dtype: float64

In [13]:
dat['percent'].mean()

0.48724618343573406

In [14]:
np.where(dat['percent']>dat['percent'].mean(),'large','small')

array(['small', 'small', 'small', 'small', 'small', 'large', 'small',
       'small', 'small', 'large', 'small', 'small', 'small', 'small',
       'large', 'large', 'small', 'small', 'large', 'small', 'small',
       'large', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'large', 'small', 'small', 'small',
       'small', 'small', 'large', 'large', 'large', 'large', 'large',
       'large', 'small', 'large', 'small', 'small', 'large', 'large',
       'large', 'small', 'small', 'large', 'large', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'large', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'large', 'large', 'small', 'large',
       'small', 'small', 'small', 'small', 'large', 'small', 'small',
       'large', 'large', 'small', 'small', 'small', 'small', 'small',
       'large', 'small', 'large', 'small', 'small', 'large', 'large',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'large', 'small',
       'large', 'small', 'large', 'small', 'small', 'small', 'small',
       'small', 'small', 'large', 'small', 'large', 'small', 'small',
       'small', 'small', 'large', 'small', 'large', 'small', 'small',
       'small', 'small', 'large', 'small', 'large', 'small', 'large',
       'small', 'small', 'small', 'large', 'small', 'small', 'large',
       'large', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'large', 'small', 'small',
       'large', 'small', 'small', 'small', 'large', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'large', 'small',
       'small', 'large', 'small', 'large', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'large', 'small', 'large', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'large',
       'small', 'large', 'small', 'small', 'large', 'small', 'small',
       'large', 'small', 'large', 'small', 'large', 'small', 'large',
       'small', 'large', 'small', 'large', 'small', 'small', 'small',
       'small', 'large', 'small', 'small', 'small', 'large', 'small',
       'large', 'small', 'large', 'small', 'large', 'small', 'small',
       'small', 'small', 'small', 'small', 'large', 'small', 'small',
       'small', 'small', 'small', 'small', 'large', 'small', 'small',
       'large', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'large', 'large', 'small', 'small', 'large', 'large',
       'small', 'large', 'small', 'small', 'small', 'large', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'large', 'small', 'small', 'large', 'small', 'small', 'small',
       'large', 'small', 'small', 'small', 'large', 'small', 'large',
       'large', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'large', 'small', 'small',
       'large', 'large', 'large', 'small', 'small', 'small', 'large',
       'small', 'small', 'large', 'small', 'large', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'large', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'large', 'small', 'large', 'small', 'small', 'small',
       'small', 'small', 'large', 'small', 'large', 'small', 'large',
       'small', 'small', 'small', 'small', 'small', 'large', 'small',
       'small', 'large', 'large', 'small', 'small', 'small', 'large',
       'small', 'small', 'large', 'large', 'large', 'small', 'large',
       'small', 'small', 'small', 'large', 'small', 'small', 'small',
       'small', 'small', 'large', 'small', 'large', 'small', 'small',
       'small', 'large', 'large', 'small', 'small', 'small', 'large',
       'small', 'small', 'small', 'large', 'large', 'small', 'large',
       'small', 'large', 'small', 'large', 'small', 'large', 'large',
       'small', 'small', 'small', 'small', 'large', 'small', 'small',
       'small', 'small', 'large', 'small', 'small', 'large', 'small',
       'small', 'large', 'large'], dtype='<U5')

In [15]:
dat['size']=np.where(dat['percent']>dat['percent'].mean(),'large','small')

In [17]:
dat['size'].value_counts()

small    318
large    119
Name: size, dtype: int64

def AVG(percent,mean):
    if percent>mean:
        return 'large'
    return 'small'

In [22]:
dat['percent'].apply(AVG,args=[dat['percent'].mean()])

0      small
1      small
2      small
3      small
4      small
       ...
432    large
433    small
434    small
435    large
436    large
Name: percent, Length: 437, dtype: object

In [24]:
np.where(dat['percent']>dat['percent'].mean(),'LARGE','small')

array(['small', 'small', 'small', 'small', 'small', 'LARGE', 'small',
       'small', 'small', 'LARGE', 'small', 'small', 'small', 'small',
       'LARGE', 'LARGE', 'small', 'small', 'LARGE', 'small', 'small',
       'LARGE', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'LARGE', 'small', 'small', 'small',
       'small', 'small', 'LARGE', 'LARGE', 'LARGE', 'LARGE', 'LARGE',
       'LARGE', 'small', 'LARGE', 'small', 'small', 'LARGE', 'LARGE',
       'LARGE', 'small', 'small', 'LARGE', 'LARGE', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'LARGE', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'LARGE', 'LARGE', 'small', 'LARGE',
       'small', 'small', 'small', 'small', 'LARGE', 'small', 'small',
       'LARGE', 'LARGE', 'small', 'small', 'small', 'small', 'small',
       'LARGE', 'small', 'LARGE', 'small', 'small', 'LARGE', 'LARGE',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'LARGE', 'small',
       'LARGE', 'small', 'LARGE', 'small', 'small', 'small', 'small',
       'small', 'small', 'LARGE', 'small', 'LARGE', 'small', 'small',
       'small', 'small', 'LARGE', 'small', 'LARGE', 'small', 'small',
       'small', 'small', 'LARGE', 'small', 'LARGE', 'small', 'LARGE',
       'small', 'small', 'small', 'LARGE', 'small', 'small', 'LARGE',
       'LARGE', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'LARGE', 'small', 'small',
       'LARGE', 'small', 'small', 'small', 'LARGE', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'LARGE', 'small',
       'small', 'LARGE', 'small', 'LARGE', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'LARGE', 'small', 'LARGE', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'LARGE',
       'small', 'LARGE', 'small', 'small', 'LARGE', 'small', 'small',
       'LARGE', 'small', 'LARGE', 'small', 'LARGE', 'small', 'LARGE',
       'small', 'LARGE', 'small', 'LARGE', 'small', 'small', 'small',
       'small', 'LARGE', 'small', 'small', 'small', 'LARGE', 'small',
       'LARGE', 'small', 'LARGE', 'small', 'LARGE', 'small', 'small',
       'small', 'small', 'small', 'small', 'LARGE', 'small', 'small',
       'small', 'small', 'small', 'small', 'LARGE', 'small', 'small',
       'LARGE', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'LARGE', 'LARGE', 'small', 'small', 'LARGE', 'LARGE',
       'small', 'LARGE', 'small', 'small', 'small', 'LARGE', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'LARGE', 'small', 'small', 'LARGE', 'small', 'small', 'small',
       'LARGE', 'small', 'small', 'small', 'LARGE', 'small', 'LARGE',
       'LARGE', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'small', 'small', 'small', 'LARGE', 'small', 'small',
       'LARGE', 'LARGE', 'LARGE', 'small', 'small', 'small', 'LARGE',
       'small', 'small', 'LARGE', 'small', 'LARGE', 'small', 'small',
       'small', 'small', 'small', 'small', 'small', 'small', 'small',
       'LARGE', 'small', 'small', 'small', 'small', 'small', 'small',
       'small', 'LARGE', 'small', 'LARGE', 'small', 'small', 'small',
       'small', 'small', 'LARGE', 'small', 'LARGE', 'small', 'LARGE',
       'small', 'small', 'small', 'small', 'small', 'LARGE', 'small',
       'small', 'LARGE', 'LARGE', 'small', 'small', 'small', 'LARGE',
       'small', 'small', 'LARGE', 'LARGE', 'LARGE', 'small', 'LARGE',
       'small', 'small', 'small', 'LARGE', 'small', 'small', 'small',
       'small', 'small', 'LARGE', 'small', 'LARGE', 'small', 'small',
       'small', 'LARGE', 'LARGE', 'small', 'small', 'small', 'LARGE',
       'small', 'small', 'small', 'LARGE', 'LARGE', 'small', 'LARGE',
       'small', 'LARGE', 'small', 'LARGE', 'small', 'LARGE', 'LARGE',
       'small', 'small', 'small', 'small', 'LARGE', 'small', 'small',
       'small', 'small', 'LARGE', 'small', 'small', 'LARGE', 'small',
       'small', 'LARGE', 'LARGE'], dtype='<U5')

In [25]:
dat['SIZE']=np.where(dat['percent']>dat['percent'].mean(),'LARGE','small')

In [26]:
dat["SIZE"].value_counts()

small    318
LARGE    119
Name: SIZE, dtype: int64

In [28]:
def a(p,m):
    if p>m:
        return "large"
    return "small"

In [32]:
dat['T']=dat['percent'].apply(a,args=[dat['percent'].mean()])

In [34]:
dat['T'].value_counts()

small    318
large    119
Name: T, dtype: int64

In [38]:
dat.columns

Index(['PID', 'county', 'state', 'area', 'total', 'popdensity', 'popwhite',
       'popblack', 'popamerindian', 'asian', 'popother', 'percwhite',
       'percblack', 'percamerindan', 'percasian', 'percother', 'popadults',
       'perchsd', 'percollege', 'percprof', 'poppovertyknown',
       'percpovertyknown', 'percbelowpoverty', 'percchildbelowpovert',
       'percadultpoverty', 'percelderlypoverty', 'inmetro', 'category',
       'percent', 'size', 'SIZE', 'T'],
      dtype='object')

In [59]:
dat['popadults']

0       43298
1        6724
2        9669
3       19272
4        3979
        ...
432    195837
433     30109
434     13316
435     88960
436     46796
Name: popadults, Length: 437, dtype: int64

In [77]:
dat[['popadults','total','PAD']]

     popadults   total           PAD
0        43298   66090  6.608934e+06
1         6724   10626  1.062537e+06
2         9669   14991  1.499036e+06
3        19272   30806  3.080537e+06
4         3979    5836  5.835318e+05
..         ...     ...           ...
432     195837  304715  3.047144e+07
433      30109   46104  4.610335e+06
434      13316   19385  1.938431e+06
435      88960  140320  1.403194e+07
436      46796   73605  7.360436e+06

[437 rows x 3 columns]

In [75]:
dat['PAD']=(dat['total']-dat['popadults']/dat['total'])*100

In [76]:
dat['PAD'].value_counts()

6.608934e+06    1
1.475474e+07    1
1.034604e+07    1
7.677835e+06    1
6.692838e+06    1
               ..
8.810837e+06    1
2.366037e+06    1
2.979637e+06    1
2.151136e+06    1
7.360436e+06    1
Name: PAD, Length: 437, dtype: int64

In [74]:
dat.sort_values('PAD',ascending=False )[['county','PAD']][0:5]

       county           PAD
15       COOK  5.105066e+08
275     WAYNE  2.111686e+08
294  CUYAHOGA  1.412139e+08
256   OAKLAND  1.083591e+08
301  FRANKLIN  9.614364e+07

In [82]:
dat['AA']=np.where(dat['PAD']>=40,'large',
np.where(dat['PAD']>=30,'middle','small'))

In [84]:
dat['AA']

0      large
1      large
2      large
3      large
4      large
       ...
432    large
433    large
434    large
435    large
436    large
Name: AA, Length: 437, dtype: object

In [86]:
dat['asian_per']=dat['asian']/dat['total']*100

In [93]:
dat.sort_values('asian_per'[:10])[['state','county','asian_per']]

    state      county  asian_per
404    WI   MENOMINEE   0.000000
105    IN      BENTON   0.010592
109    IN     CARROLL   0.015950
358    OH      VINTON   0.027032
390    WI        IRON   0.032504
..    ...         ...        ...
180    IN  TIPPECANOE   3.691481
15     IL        COOK   3.693683
274    MI   WASHTENAW   4.143679
9      IL   CHAMPAIGN   4.642682
21     IL     DU PAGE   5.070452

[437 rows x 3 columns]

In [97]:
len(dat['state'].unique())

5

In [98]:
dat.groupby('state')

In [99]:
dat.groupby('state')['asian_per'].mean().sort_values()

state
IN    0.382658
OH    0.432803
MI    0.506877
WI    0.556213
IL    0.563895
Name: asian_per, dtype: float64

In [100]:
####sort_values() 오름차순

In [103]:
dat.groupby('state')['asian_per'].mean()

state
IL    0.563895
IN    0.382658
MI    0.506877
OH    0.432803
WI    0.556213
Name: asian_per, dtype: float64

In [104]:
len(dat['county'].unique())

320

In [105]:
####len(dat['county'].unique())

In [107]:
len(dat['county'])

437

In [108]:
dat['inmetro'].value_counts()

0    287
1    150
Name: inmetro, dtype: int64

In [111]:
dat.loc[0,'county']='sanghyun'

In [114]:
##dat.apply
###np.apply
##np.where

NameError: name 'dac' is not defined

In [ ]:
|